tutorials/tgv2D/system/blockMeshDict
FoamFile { version 2.0; format ascii; class dictionary; object blockMeshDict; }
scale 1;
L 6.283185307179586;
vertices ( (0 0 0) ($L 0 0) ($L $L 0) (0 $L 0) (0 0 0.1) ($L 0 0.1) ($L $L 0.1) (0 $L 0.1) );
blocks ( hex (0 1 2 3 4 5 6 7) (32 32 1) simpleGrading (1 1 1) );
boundary
(
    left  { type cyclic; neighbourPatch right; faces ((0 4 7 3)); }
    right { type cyclic; neighbourPatch left;  faces ((1 2 6 5)); }
    bottom{ type cyclic; neighbourPatch top;   faces ((0 1 5 4)); }
    top   { type cyclic; neighbourPatch bottom; faces ((3 7 6 2)); }
    frontAndBack { type empty; faces ((0 3 2 1) (4 5 6 7)); }
);
