tutorials/tgv2D/system/auditOffline
FoamFile { version 2.0; format ascii; class dictionary; object auditOffline; }
functions { kineticEnergyAudit { type kineticEnergyAudit; libs (cosamEnergyAuditFunctionObjects); writeFields false; offline true; } }
